using System;
/*

Task01

Дисциплина: "Программирование"

Группа: БПИ202

Студент: Алиева Рената

Дата: 11.09.2020

Задача: 

 Создать решение с именем HW_1 и проектом консольного приложения Task01.
В Task01 осуществить вывод на экран строки “Hello, World!”



*/

namespace Homework_1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
            Console.WriteLine("Для выхода нажмите Enter");
            Console.ReadLine();
        }
    }
}
